/*********************************************************************************************************************
* CH-04 蓝牙模块 应用示例 头文件
********************************************************************************************************************/

#ifndef _BLUETOOTH_CH04_EXAMPLE_H_
#define _BLUETOOTH_CH04_EXAMPLE_H_

#include "zf_common_typedef.h"

//-------------------------------------------------------------------------------------------------------------------
// 函数声明
//-------------------------------------------------------------------------------------------------------------------

void bluetooth_ch04_process_data (uint8 *data_packet, uint32 length);
void bluetooth_ch04_handle_receive (void);
void bluetooth_ch04_init_example (void);
void bluetooth_ch04_test (void);

#endif