#ifndef __BUZZERANDLED_H
#define __BUZZERANDLED_H

#include "zf_common_typedef.h"

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     声光模块初始化
// 使用示例     BuzzerAndLED_Init();
// 备注信息     只在"Menu.c"中的Peripheral_Init();函数调用一次
//-------------------------------------------------------------------------------------------------------------------

void BuzzerAndLED_Init(void);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     开关蜂鸣器/LED
// 使用示例     BuzzerAndLED_Promopt();
// 备注信息     只在"Menu.c"中的Peripheral_Init();函数调用一次
//-------------------------------------------------------------------------------------------------------------------


void BuzzerAndLED_Promopt(uint8_t Mode);

#endif