#ifndef __ENCODER_H
#define __ENCODER_H

#include "zf_common_typedef.h"

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     编码器初始化
// 参数说明     无
// 返回参数     无
// 使用示例     Encoder_Init();
// 备注信息     只在"Menu.c"中的Peripheral_Init();函数调用一次
//-------------------------------------------------------------------------------------------------------------------

void Encoder_Init(void);
	
//-------------------------------------------------------------------------------------------------------------------
// 函数简介     获取编码器（电机1(左)）计数值
// 参数说明     无
// 返回参数     无
// 使用示例     LeftSpeed  = Get_Encoder1();
//				(LeftSpeed 为在"param_config.c"中定义的extern变量)
// 备注信息     一般作为速度环的必要调用，注意调用后计数值清零
//-------------------------------------------------------------------------------------------------------------------	

int Get_Encoder1(void);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     获取编码器（电机2(右)）计数值
// 参数说明     无
// 返回参数     无
// 使用示例     RightSpeed  = Get_Encoder2();
//				(RightSpeed 为在"param_config.c"中定义的extern变量)
// 备注信息     一般作为速度环的必要调用，注意调用后计数值清零
//-------------------------------------------------------------------------------------------------------------------	

int Get_Encoder2(void);
	
#endif
