#include "zf_driver_gpio.h"

// LED引脚
#define LED1                (H2 )
#define LED2                (B13)
// 蜂鸣器引脚
#define BEEP                (D7 )

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     声光模块初始化
// 参数说明     无
// 返回参数     无
// 使用示例     LED_and_Buzzer_Init();
// 备注信息     只在"Menu.c"中的Peripheral_Init();函数调用一次
//-------------------------------------------------------------------------------------------------------------------
