#include "param_config.h"

// 定义全局变量（真正分配内存的地方）

// PWM输出
int16_t LeftPWM  = 0;					//左轮PWM
int16_t RightPWM = 0;					//右轮PWM
int16_t	AvePWM   = 0;					//平均PWM
int16_t DifPWM   = 0;					//差分PWM


float Pre_LeftSpeed, Pre_RightSpeed;	//左轮上次速度，右轮上次速度
float LeftSpeed, RightSpeed;			//左轮实际速度，右轮实际速度
float AveSpeed, DifSpeed;				//平均实际速度，差分实际速度


// 调控周期计时器
uint16_t Time_Count1 = 0;
uint16_t Time_Count2 = 0;
// 延时
uint16_t BuzzerAndLED_Delay_Timer = 0;

/*******************************************************************************************************************/
/*[S] 标志位 [S]---------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

// 启停标志位
uint8_t Run_Flag = 0;
// MPU6050 分析使能标志位
volatile uint8_t mpu6050_analysis_enable = 0;

/*******************************************************************************************************************/
/*[E] 标志位 [E]---------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/


/*******************************************************************************************************************/
/*[S] PID [S]------------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

// 注：pid结构体类型定义，位于"PID.h"

// 角速度环PID参数
PID_t Rate__PID = {
	.OutMax = 8000,      			// 输出限幅（上限）
    .OutMin = -8000,				// 输出限幅（下限）
    .IntSepThresh = 0,   			// 积分分离阈值（误差大于阈值 积分清零）
    .ErrorIntMax = 0,				// 积分限幅（上限）
    .ErrorIntMin = 0,				// 积分限幅（下限）
    .OutOffset = 500,					// 输出偏移
};
// 角度环PID参数
PID_t Angle_PID = {
	.OutMax = 50,					// 输出限幅（上限）
	.OutMin = -50,					// 输出限幅（下限）
	.IntSepThresh = 6,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 10,				// 积分限幅（上限）
	.ErrorIntMin = -10,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 速度环PID参数
PID_t Speed_PID = {	
	.OutMax = 10,					// 输出限幅（上限）
	.OutMin = -10,					// 输出限幅（下限）
	.IntSepThresh = 20,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 5,				// 积分限幅（上限）
	.ErrorIntMin = -5,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 转向环PID参数
PID_t Turn__PID = {	
	.OutMax = 6000,					// 输出限幅（上限）
	.OutMin = -6000,				// 输出限幅（下限）
	.IntSepThresh = 5000,			// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 3000,			// 积分限幅（上限）
	.ErrorIntMin = -3000,			// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 循迹环PID参数
PID_t Track_PID = {	
	.OutMax = 30,					// 输出限幅（上限）
	.OutMin = -30,					// 输出限幅（下限）
	.IntSepThresh = 5,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 10,				// 积分限幅（上限）
	.ErrorIntMin = -10,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};


// PID参数修改步长值（非蓝牙模块）
const float PID_STEPS[5][3] = {
    {1.0f, 0.1f, 1.0f},   	// Rate__PID：Kp=1.0, Ki=0.01, Kd=0.1
    {0.1f, 0.1f, 0.1f}, 	// Angle_PID：Kp=0.5, Ki=0.02, Kd=0.05
    {0.1f, 0.1f, 0.1f},  	// Speed_PID：Kp=0.2, Ki=0.005, Kd=0.2
    {0.1f, 0.1f, 0.1f},  	// Turn__PID：Kp=0.8, Ki=0.015, Kd=0.1
    {0.1f, 0.1f, 0.1f}   	// Track_PID：Kp=0.3, Ki=0.01, Kd=0.15
};

/*******************************************************************************************************************/
/*[E] PID [E]------------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

