#include "param_config.h"


// 定义全局变量（真正分配内存的地方）


/*******************************************************************************************************************/
/*[S] 数值相关（计数/计时/中间交换量） [S]-------------------------------------------------------------------------*/
/*******************************************************************************************************************/

// PWM输出
int16_t LeftPWM  = 0;					//左轮PWM
int16_t RightPWM = 0;					//右轮PWM
int16_t	AvePWM   = 0;					//平均PWM
int16_t DifPWM   = 0;					//差分PWM


int32_t Encoder_Left = 0, Encoder_Right = 0;			//左轮编码器值，右轮编码器值
float Pre_LeftSpeed = 0.0f, Pre_RightSpeed = 0.0f;		//左轮上次速度，右轮上次速度
float LeftSpeed     = 0.0f, RightSpeed     = 0.0f;		//左轮实际速度，右轮实际速度
float AveSpeed      = 0.0f, DifSpeed       = 0.0f;		//平均实际速度，差分实际速度


// 调控周期计时器
volatile uint16_t Time_Count1 = 0;
volatile uint16_t Time_Count2 = 0;

// 延时（倒计时）（干脆命名为1、2这些了，用的时候麻烦注意）
uint16_t Delay_Timer_1 = 0;
uint16_t Delay_Timer_2 = 0;
uint16_t Delay_Timer_3 = 0;

// 目标YAW角（我考虑在蓝牙模块预留控制接口，所以在这里定义）
float Yaw_Target = 0.0f;

// 获取mpu6050实际dt（1ms精度）
volatile uint32_t MPU6050_Time_Count_1ms = 0;
float MPU6050_Last_dt = 0.005f;
uint32_t MPU6050_Last_Count_1ms = 0;

/*******************************************************************************************************************/
/*[E] 数值相关（计数/计时/中间交换量） [E]-------------------------------------------------------------------------*/
/*******************************************************************************************************************/



/*******************************************************************************************************************/
/*[S] 标志位 [S]---------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

// 启停标志位
uint8_t Run_Flag = 0;
// MPU6050 分析使能标志位
volatile uint8_t mpu6050_analysis_enable = 0;
// 惯性导航 使能标志位
volatile uint8_t navigation_enable = 0;
// 航向角PID使能
volatile uint8_t Head_PID_control_enable = 0;
/*******************************************************************************************************************/
/*[E] 标志位 [E]---------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/



/*******************************************************************************************************************/
/*[S] PID [S]------------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

// 注：pid结构体类型定义，位于"PID.h"

// 角速度环PID参数
PID_t Rate__PID = {
	.OutMax = 8000,      			// 输出限幅（上限）
    .OutMin = -8000,				// 输出限幅（下限）
    .IntSepThresh = 0,   			// 积分分离阈值（误差大于阈值 积分清零）
    .ErrorIntMax = 0,				// 积分限幅（上限）
    .ErrorIntMin = 0,				// 积分限幅（下限）
    .OutOffset = 0,					// 输出偏移
};
// 角度环PID参数
PID_t Angle_PID = {
	.OutMax = 200,					// 输出限幅（上限）
	.OutMin = -200,					// 输出限幅（下限）
	.IntSepThresh = 30,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 100,				// 积分限幅（上限）
	.ErrorIntMin = -100,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 速度环PID参数
PID_t Speed_PID = {	
	.OutMax = 3,					// 输出限幅（上限）
	.OutMin = -2,					// 输出限幅（下限）
	.IntSepThresh = 20,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 2,				// 积分限幅（上限）
	.ErrorIntMin = -2,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 转向环PID参数
PID_t Turn__PID = {	
	.OutMax = 6000,					// 输出限幅（上限）
	.OutMin = -6000,				// 输出限幅（下限）
	.IntSepThresh = 50,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 3000,			// 积分限幅（上限）
	.ErrorIntMin = -3000,			// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 循迹环PID参数
PID_t Track_PID = {	
	.OutMax = 35,					// 输出限幅（上限）
	.OutMin = -35,					// 输出限幅（下限）
	.IntSepThresh = 5,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 10,				// 积分限幅（上限）
	.ErrorIntMin = -10,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 航向角环PID参数
PID_t Head__PID = {
	.OutMax = 45,					// 输出限幅（上限）
	.OutMin = -45,					// 输出限幅（下限）
	.IntSepThresh = 0,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 0,				// 积分限幅（上限）
	.ErrorIntMin = -0,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};
// 位置环PID参数
PID_t Posi__PID = {
	.OutMax = 30,					// 输出限幅（上限）
	.OutMin = -30,					// 输出限幅（下限）
	.IntSepThresh = 50,				// 积分分离阈值（误差大于阈值 积分清零）
	.ErrorIntMax = 50,				// 积分限幅（上限）
	.ErrorIntMin = -50,				// 积分限幅（下限）
	.OutOffset = 0,					// 输出偏移
};

// PID参数修改步长值（非蓝牙模块）
const float PID_STEPS[7][3] = {
    {1.0f, 0.1f, 1.0f},    	// Rate__PID：Kp, Ki, Kd
    {0.1f, 0.1f, 0.1f},  	// Angle_PID：Kp, Ki, Kd
    {0.1f, 0.1f, 0.1f},   	// Speed_PID：Kp, Ki, Kd
    {0.1f, 0.1f, 0.1f},   	// Turn__PID：Kp, Ki, Kd
    {0.1f, 0.1f, 0.1f},    	// Track_PID：Kp, Ki, Kd
	{0.1f, 0.1f, 0.1f},   	// Head__PID：Kp, Ki, Kd
	{0.1f, 0.1f, 0.1f}    	// Posi__PID：Kp, Ki, Kd
};

/*******************************************************************************************************************/
/*[E] PID [E]------------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

